---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewerBoundOffsetTop
source: html/7961deb3-f0e0-ee35-df99-45eb16e7c6ba.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewerBoundOffsetTop Property

"Top Clip Offset"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewerBoundOffsetTop { get; }
```